[
  {
    "DOI": "https://doi.org/10.1016/j.scitotenv.2021.150139",
    "ISSN": "0048-9697",
    "URL": "https://www.sciencedirect.com/science/article/pii/S0048969721052141",
    "abstract": "Although significant scientific research strides have been made in mapping the spatial extents and ecohydrological dynamics of wetlands in semi-arid environments, the focus on small wetlands remains a challenge. This is due to the sensing characteristics of remote sensing platforms and lack of robust data processing techniques. Advancements in data analytic tools, such as the introduction of Google Earth Engine (GEE) platform provides unique opportunities for improved assessment of small and scattered wetlands. This study thus assessed the capabilities of GEE cloud-computing platform in characterising small seasonal flooded wetlands, using the new generation Sentinel 2 data from 2016 to 2020. Specifically, the study assessed the spectral separability of different land cover classes for two different wetlands detected, using Sentinel-2 multi-year composite water and vegetation indices and to identify the most suitable GEE machine learning algorithm for accurately detecting and mapping semi-arid seasonal wetlands. This was achieved using the object based Random Forest (RF), Support Vector Machine (SVM), Classification and Regression Tree (CART) and Naïve Bayes (NB) advanced algorithms in GEE. The results demonstrated the capabilities of using the GEE platform to characterize wetlands with acceptable accuracy. All algorithms showed superiority, in mapping the two wetlands except for the NB method, which had lowest overall classification accuracy. These findings underscore the relevance of the GEE platform, Sentinel-2 data and advanced algorithms in characterizing small and seasonal semi-arid wetlands.",
    "author": [
      {
        "family": "Gxokwe",
        "given": "Siyamthanda"
      },
      {
        "family": "Dube",
        "given": "Timothy"
      },
      {
        "family": "Mazvimavi",
        "given": "Dominic"
      }
    ],
    "container-title": "Science of The Total Environment",
    "id": "GXOKWE2022150139",
    "issued": {
      "date-parts": [
        [
          2022
        ]
      ]
    },
    "keyword": "Limpopo River Basin, Object-based classification, Machine learning algorithm, Wetland mapping, Wetland condition",
    "page": "150139",
    "title": "Leveraging google earth engine platform to characterize and map small seasonal wetlands in the semi-arid environments of south africa",
    "type": "article-journal",
    "volume": "803"
  }
]
